cask_args appdir: "/Applications"
cask_args no_quarantine: true

# Brew
brew "curl"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "grep"
brew "gzip"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "lazygit"
brew "macchina"
brew "mas"
brew "mise"
brew "neovim"
brew "pkgconf"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tldr"
brew "wget"
brew "zoxide"
brew "zsh"

# Cask
cask "bitwarden"
cask "firefox"
cask "ghostty"
cask "hammerspoon"
cask "hiddenbar"
cask "inkscape"
cask "jukebox"
cask "karabiner-elements"
cask "logi-options+"
cask "obsidian"
cask "orion"
cask "rancher"
cask "spaceman"
cask "spotify"
cask "the-unarchiver"
cask "utm"
cask "vivaldi"

# Fonts
cask "font-iosevka-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-sn-pro"

# App Store
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
