cask_args appdir: "/Applications"
cask_args no_quarantine: true

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/services"

# Brew
brew "clipboard"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "grep"
brew "gzip"
brew "jq"
brew "lazygit"
brew "macchina"
brew "mas"
brew "mise"
brew "neovim"
brew "p7zip"
brew "qemu"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "wget"
brew "zoxide"
brew "zsh"
brew "koekeishiya/formulae/yabai"

# Cask
cask "background-music"
cask "bitwarden"
cask "blackhole-16ch"
cask "docker"
cask "equinox"
cask "firefox"
cask "hammerspoon"
cask "karabiner-elements"
cask "kitty"
cask "logi-options+"
cask "obsidian"
cask "orion"
cask "raycast"
cask "spaceid"
cask "spotify"
cask "steam"
cask "the-unarchiver"
cask "visual-studio-code"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-sn-pro"

# App Store
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
