cask_args appdir: "/Applications"

# Brew
brew "bat"
brew "curl"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "gzip"
brew "fastfetch"
brew "jq"
brew "lazygit"
brew "mas"
brew "mdq"
brew "mise"
brew "neovim"
brew "ollama"
brew "pkgconf"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tlrc"
brew "tree"
brew "yq"
brew "zoxide"
brew "zsh"

# Cask
cask "bitwarden"
cask "blender"
cask "figma"
cask "firefox"
cask "ghostty"
cask "inkscape"
cask "kicad"
cask "logi-options+"
cask "microsoft-teams"
cask "obsidian"
cask "orion"
cask "qutebrowser"
cask "rancher"
cask "the-unarchiver"
cask "utm"
cask "vivaldi"
cask "zed"

# Fonts
cask "font-iosevka-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-sn-pro"

# App Store
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
